##   INTRO TO PYTHON

In [128]:
import pandas as pd

In [129]:
a = 10
b = 20
my_string = "Hello folks"

In [130]:
print a+b

30

In [131]:
print my_string + ','+' "Welcome to Big Data"'

Hello folks, "Welcome to Big Data"

In [132]:
10+20

30

In [133]:
10/20.0

0.5

In [134]:
8%5

3

In [135]:
8//5

1

In [136]:
a==20

False

In [137]:
a -= 5
print a

5

In [138]:
print int(10.56), float(5)

10 5.0

In [139]:
print round(8.45789,3)

8.458

In [140]:
isinstance (5,float)

False

In [141]:
print isinstance (b, str)

False

In [142]:
c =  isinstance (a,(int,str))

In [143]:
print pow(2,5,8)

0

In [144]:
print range(5)
print range(2,10)
print range (10,50,7)

[0, 1, 2, 3, 4]
[2, 3, 4, 5, 6, 7, 8, 9]
[10, 17, 24, 31, 38, 45]

In [145]:
print 'My first variable is "a", it\'s value was %d, current value is %d'%(10,a)

My first variable is "a", it's value was 10, current value is 5

In [146]:
type (c)

bool

##                                  LIST AND TUPLE                                 ##

In [147]:
my_colors = ["red", "Blue", "green", "orange", "yellow"]

In [148]:
my_colors[2]

'green'

In [149]:
X = [2,4,6,8,10]

In [150]:
X[2]=X[1]+X[2]
print X

[2, 4, 10, 8, 10]

In [151]:
Y = [my_colors, X]
print Y, Y[1][4]

[['red', 'Blue', 'green', 'orange', 'yellow'], [2, 4, 10, 8, 10]] 10

In [152]:
len(my_colors), max(X)

(5, 10)

In [153]:
X.index(8)

3

In [154]:
Y.remove(X)
Y.remove(my_colors)

In [155]:
Y.append(X)
Y.extend(my_colors)

In [156]:
print Y

[[2, 4, 10, 8, 10], 'red', 'Blue', 'green', 'orange', 'yellow']

In [157]:
X.reverse()
print X

[10, 8, 10, 4, 2]

In [158]:
Y.sort()
print Y

[[10, 8, 10, 4, 2], 'Blue', 'green', 'orange', 'red', 'yellow']

In [159]:
Y.sort(reverse=True)
print Y

['yellow', 'red', 'orange', 'green', 'Blue', [10, 8, 10, 4, 2]]

In [160]:
X.pop()

2

In [161]:
X

[10, 8, 10, 4]

In [162]:
M = X ##### Copying a list

In [163]:
M

[10, 8, 10, 4]

In [164]:
M = X[:]

In [165]:
M

[10, 8, 10, 4]

In [166]:
X.append(5)

In [167]:
X

[10, 8, 10, 4, 5]

In [168]:
M ##### Copying a list

[10, 8, 10, 4]

In [169]:
K = tuple('hi-big-data')
print K

('h', 'i', '-', 'b', 'i', 'g', '-', 'd', 'a', 't', 'a')

In [170]:
K.count("-")

2

In [171]:
K.index("a")

8

In [172]:
set_a = set([1,2,3,4,5,6,7])
set_b = set([3,4,8,10])

In [173]:
set_a.union(set_b)

{1, 2, 3, 4, 5, 6, 7, 8, 10}

In [174]:
set_b.add(9)

In [175]:
set_c=set_a.union(set_b)
print set_c

set([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

In [176]:
set_c.issuperset(set_a)

True

In [177]:
set_c.clear()
print set_c

set([])

In [178]:
my_list = [1,2,3,4,a,b,c]
if a in my_list:
    print "Yes im in"
else:
    print "Sorry im not"

Yes im in

In [179]:
my_name = ['Mike haniston', 'joseph Mathew', 'Prabhu Raam']
for name in my_name:
    name_1 = name.split(" ")[0]
    print name_1

Mike
joseph
Prabhu

In [180]:
my_vowel="aeiou"
my_words = ['who', 'what', 'when', 'where', 'why', 'sly', 'shy', 'bashful', 'coy', 'myth', 'hymn']
for word in my_words:
    for letter in word:
        if letter in my_vowel:
            print word, "has vowel"
print "END"

who has vowel
what has vowel
when has vowel
where has vowel
where has vowel
bashful has vowel
bashful has vowel
coy has vowel
END

### PANDAS###

In [181]:
import pandas as pandas
import datetime

In [182]:
my_datetime = datetime.datetime(2017,1,1)
my_datetime2= datetime.datetime(2017,7,30)
date_delta = datetime.timedelta(days=30)
date_list =[]

In [183]:
while my_datetime < my_datetime2:
    date_list.append(my_datetime.strftime('%m-%d'))
    my_datetime += date_delta

In [184]:
date_list

['01-01', '01-31', '03-02', '04-01', '05-01', '05-31', '06-30']

In [185]:
d = {'Date': date_list, 'C1' : [15,19,15,11,9,8,13], 'C2': [-2,0,2,5,7,-5,-3], 'C3':[20,18,23,19,25,27,23]}

In [186]:
d

{'C1': [15, 19, 15, 11, 9, 8, 13],
 'C2': [-2, 0, 2, 5, 7, -5, -3],
 'C3': [20, 18, 23, 19, 25, 27, 23],
 'Date': ['01-01', '01-31', '03-02', '04-01', '05-01', '05-31', '06-30']}

In [187]:
df = pandas.DataFrame(d)

In [188]:
df

   C1  C2  C3   Date
0  15  -2  20  01-01
1  19   0  18  01-31
2  15   2  23  03-02
3  11   5  19  04-01
4   9   7  25  05-01
5   8  -5  27  05-31
6  13  -3  23  06-30

In [189]:
df.set_index('Date')

       C1  C2  C3
Date
01-01  15  -2  20
01-31  19   0  18
03-02  15   2  23
04-01  11   5  19
05-01   9   7  25
05-31   8  -5  27
06-30  13  -3  23

In [190]:
vehicle = pandas.read_csv('./data/vehicles_test.csv')

In [191]:
vehicle.doors.value_counts()

4    2
2    1
Name: doors, dtype: int64

In [192]:
vehicle.head()

   price  year   miles  doors   type
0   3000  2003  130000      4  truck
1   6000  2005   82500      4    car
2  12000  2010   60000      2    car

SERIES

In [193]:
my_series = pandas.Series([1,2,3,'String'])

In [194]:
my_series

0         1
1         2
2         3
3    String
dtype: object

In [195]:
index = ['a' , 'b' , 'c' , 'd']

In [196]:
my_series.index = index

In [197]:
my_series

a         1
b         2
c         3
d    String
dtype: object

In [198]:
my_series1= pandas.Series({'London':10, 'Newyork': 20 , 'NewDelhi':30})

In [199]:
my_series1[my_series1==20]

Newyork    20
dtype: int64

In [200]:
index2 = ['London', 'Newyork', 'Chennai']

In [201]:
my_series2 =  pandas.Series({'London':10, 'Newyork': 20 , 'NewDelhi':30})

In [202]:
my_series2.index = index2

In [203]:
my_series2

London     10
Newyork    30
Chennai    20
dtype: int64

In [204]:
my_series1 + my_series2

Chennai      NaN
London      20.0
NewDelhi     NaN
Newyork     50.0
dtype: float64

In [205]:
my_series1.isnull()

London      False
NewDelhi    False
Newyork     False
dtype: bool

In [206]:
my_series2.notnull()

London     True
Newyork    True
Chennai    True
dtype: bool

In [207]:
data = {'City': ['Newyork', 'Chennai', 'Mumbai', 'Delhi'],
        'year': [2000, 2000, 2000, 2000 ],
        'pollution': [1.5, 1.7, 3.6, 2.4]}

In [208]:
dframe1= pandas.DataFrame(data , columns=['City', 'year', 'pollution', 'IncreaseInPerc'])

In [209]:
dframe1.index = ['One', 'Two', 'Three', 'Four']

In [210]:
dframe1

          City  year  pollution IncreaseInPerc
One    Newyork  2000        1.5            NaN
Two    Chennai  2000        1.7            NaN
Three   Mumbai  2000        3.6            NaN
Four     Delhi  2000        2.4            NaN

In [211]:
dframe1.loc['Two']

City              Chennai
year                 2000
pollution             1.7
IncreaseInPerc        NaN
Name: Two, dtype: object

In [212]:
dframe1['City'] # This is access column in Dataframe

One      Newyork
Two      Chennai
Three     Mumbai
Four       Delhi
Name: City, dtype: object

In [213]:
import numpy as my_numpy

In [214]:
my_numpy.arange(1,3,0.6)

array([ 1. ,  1.6,  2.2,  2.8])

In [215]:
dframe1['IncreaseInPerc'] = my_numpy.arange(1,3,0.6)

In [216]:
dframe1

          City  year  pollution  IncreaseInPerc
One    Newyork  2000        1.5             1.0
Two    Chennai  2000        1.7             1.6
Three   Mumbai  2000        3.6             2.2
Four     Delhi  2000        2.4             2.8

In [217]:
dframe1['HiglyPolluted']= dframe1.IncreaseInPerc > 2.0

In [218]:
dframe1

          City  year  pollution  IncreaseInPerc  HiglyPolluted
One    Newyork  2000        1.5             1.0          False
Two    Chennai  2000        1.7             1.6          False
Three   Mumbai  2000        3.6             2.2           True
Four     Delhi  2000        2.4             2.8           True

In [219]:
del dframe1['HiglyPolluted']

In [220]:
dframe1

          City  year  pollution  IncreaseInPerc
One    Newyork  2000        1.5             1.0
Two    Chennai  2000        1.7             1.6
Three   Mumbai  2000        3.6             2.2
Four     Delhi  2000        2.4             2.8

In [221]:
dframe1.T

                    One      Two   Three   Four
City            Newyork  Chennai  Mumbai  Delhi
year               2000     2000    2000   2000
pollution           1.5      1.7     3.6    2.4
IncreaseInPerc        1      1.6     2.2    2.8

In [222]:
dframe1.index.name ='PollData'

In [223]:
dframe1

             City  year  pollution  IncreaseInPerc
PollData
One       Newyork  2000        1.5             1.0
Two       Chennai  2000        1.7             1.6
Three      Mumbai  2000        3.6             2.2
Four        Delhi  2000        2.4             2.8

In [224]:
dframe1.columns.name='CityWiseData'

In [225]:
dframe1

CityWiseData     City  year  pollution  IncreaseInPerc
PollData
One           Newyork  2000        1.5             1.0
Two           Chennai  2000        1.7             1.6
Three          Mumbai  2000        3.6             2.2
Four            Delhi  2000        2.4             2.8

In [226]:
dframe1.values

array([['Newyork', 2000, 1.5, 1.0],
       ['Chennai', 2000, 1.7, 1.6],
       ['Mumbai', 2000, 3.6, 2.2],
       ['Delhi', 2000, 2.4, 2.8000000000000003]], dtype=object)

In [227]:
dframe1.index

Index([u'One', u'Two', u'Three', u'Four'], dtype='object', name=u'PollData')

In [228]:
'Newyork' in dframe1.values

True

In [229]:
'Two' in dframe1.index

True

In [230]:
'City' in dframe1.columns

True

In [231]:
reindexDF = pandas.DataFrame(data , columns=['City', 'year', 'pollution' ])

In [232]:
reindexDF

      City  year  pollution
0  Newyork  2000        1.5
1  Chennai  2000        1.7
2   Mumbai  2000        3.6
3    Delhi  2000        2.4

In [233]:
reindexDF.index = ['One','Two','Three','Four']

In [234]:
reindexDF2 = reindexDF.reindex(['One','Two','Three','Four','Five'])

In [235]:
reindexDF2

          City    year  pollution
One    Newyork  2000.0        1.5
Two    Chennai  2000.0        1.7
Three   Mumbai  2000.0        3.6
Four     Delhi  2000.0        2.4
Five       NaN     NaN        NaN

In [236]:
obj3 = pandas.Series(['Circle', 'Triangle', 'Square'], index=[0, 2, 4])

In [237]:
obj3

0      Circle
2    Triangle
4      Square
dtype: object

In [238]:
obj3.reindex(range(6), method='ffill')

0      Circle
1      Circle
2    Triangle
3    Triangle
4      Square
5      Square
dtype: object

In [239]:
frame = pandas.DataFrame(my_numpy.arange(9).reshape((3, 3)) ,index = [0,2,4] , columns=['Newyork','Chennai','Delhi'])

In [240]:
up_frame = frame.reindex ([0,2,4,6])

In [241]:
up_frame

   Newyork  Chennai  Delhi
0      0.0      1.0    2.0
2      3.0      4.0    5.0
4      6.0      7.0    8.0
6      NaN      NaN    NaN

In [242]:
drop_exmaple = pandas.DataFrame(my_numpy.arange(16).reshape(4,4) , index=['S01','S02','S03','S04'] , columns =['Newyork', 'Chennai', 'Delhi', 'Mumbai'])

In [243]:
drop_exmaple

     Newyork  Chennai  Delhi  Mumbai
S01        0        1      2       3
S02        4        5      6       7
S03        8        9     10      11
S04       12       13     14      15

In [244]:
drop_exmaple.drop(['S01'])

     Newyork  Chennai  Delhi  Mumbai
S02        4        5      6       7
S03        8        9     10      11
S04       12       13     14      15

In [245]:
drop_exmaple.drop(['S01','S03'])

     Newyork  Chennai  Delhi  Mumbai
S02        4        5      6       7
S04       12       13     14      15

In [246]:
drop_exmaple.drop(['Newyork'], axis=1 , inplace=True)

In [247]:
drop_exmaple

     Chennai  Delhi  Mumbai
S01        1      2       3
S02        5      6       7
S03        9     10      11
S04       13     14      15

In [248]:
drop_exmaple.describe()

         Chennai      Delhi     Mumbai
count   4.000000   4.000000   4.000000
mean    7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978
min     1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000
50%     7.000000   8.000000   9.000000
75%    10.000000  11.000000  12.000000
max    13.000000  14.000000  15.000000

In [249]:
drop_exmaple.iloc[0]

Chennai    1
Delhi      2
Mumbai     3
Name: S01, dtype: int64

In [250]:
drop_exmaple.loc['S01']

Chennai    1
Delhi      2
Mumbai     3
Name: S01, dtype: int64

In [251]:
df1 = pandas.DataFrame(my_numpy.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pandas.DataFrame(my_numpy.arange(9).reshape(3,3) , columns = list('abc'),
                  index =['Ohio', 'Texas', 'Colorado'])

In [252]:
df1 + df2

           a     b     c   d
Ohio     NaN   1.0   3.0 NaN
Texas    NaN   7.0   9.0 NaN
Colorado NaN  13.0  15.0 NaN

In [253]:
df1-df2

           a    b    c   d
Ohio     NaN -1.0 -1.0 NaN
Texas    NaN -1.0 -1.0 NaN
Colorado NaN -1.0 -1.0 NaN

In [254]:
df1 = pandas.DataFrame(my_numpy.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pandas.DataFrame(my_numpy.arange(20.).reshape((4, 5)) ,  
                   columns=list('abcde'))

In [255]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [256]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [257]:
df2.iloc[0,0]

0.0

In [258]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [259]:
df1.add (df2 , fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [260]:
df1.reindex (columns=df2.columns , fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [261]:
frame = pandas.DataFrame(my_numpy.random.randn(4, 3), columns=list('ABC'),
                     index=['r1', 'r2', 'r3', 'r4'])

In [262]:
frame

           A         B         C
r1 -0.175392 -0.559752 -0.332716
r2  0.439317  0.166902  0.298011
r3 -1.842180  0.907254 -0.747868
r4 -0.245663  2.672448  2.060672

In [263]:
my_numpy.abs(frame)

           A         B         C
r1  0.175392  0.559752  0.332716
r2  0.439317  0.166902  0.298011
r3  1.842180  0.907254  0.747868
r4  0.245663  2.672448  2.060672

In [264]:
frame

           A         B         C
r1 -0.175392 -0.559752 -0.332716
r2  0.439317  0.166902  0.298011
r3 -1.842180  0.907254 -0.747868
r4 -0.245663  2.672448  2.060672

In [265]:
f = lambda x: x.max() - x.min()
frame.apply(f)

frame.max()

A    0.439317
B    2.672448
C    2.060672
dtype: float64

In [266]:
frame.max(axis=1)

r1   -0.175392
r2    0.439317
r3    0.907254
r4    2.672448
dtype: float64